, 199386
. 166889
de 165618
a 85692
e 83348
o 50170
) 46418
( 45758
da 44923
do 44125
em 40190
que 39204
: 29116
com 27435
para 27280
os 26330
no 24171
dos 20224
na 20048
as 19965
% 17102
saúde 16865
por 16335
um 14462
uma 13659
das 13347
não 13173
como 13168
foi 13060
é 11866
à 11470
ao 11423
entre 10725
foram 10596
mais 9415
ou 9203
se 8582
" 7782
estudo 7543
são 6649
nos 6079
ser 5811
sobre 5621
1 5311
dados 5143
maior 5093
anos 5091
brasil 4742
of 4680
nas 4613
pelo 4585
pela 4242
trabalho 4113
and 4096
análise 4084
2 4076
sua 4046
al 3923
pacientes 3841
aos 3810
também 3785
et 3781
in 3691
resultados 3509
relação 3439
casos 3428
- 3366
uso 3330
estudos 3295
sendo 3242
mulheres 3196
serviços 3186
the 3156
3 3135
população 3117
pode 2986
] 2939
[ 2937
pesquisa 2851
às 2835
quando 2792
avaliação 2753
estado 2720
idade 2688
grupo 2669
atenção 2666
cada 2638
p 2618
forma 2609
sistema 2605
tabela 2591
risco 2587
j 2568
processo 2528
fatores 2498
período 2473
número 2453
vida 2450
social 2447
tratamento 2443
quanto 2396
outros 2384
após 2354
= 2319
segundo 2304
; 2297
4 2288
ainda 2271
variáveis 2262
health 2243
tem 2232
além 2221
profissionais 2214
doença 2190
10 2180
este 2147
tempo 2127
assim 2118
mesmo 2112
prevalência 2112
ministério 2083
três 2081
5 2072
informações 2068
rio 2064
dois 2060
qualidade 2042
seu 2002
nacional 1995
apenas 1939
grupos 1931
durante 1885
média 1877
http 1875
nível 1858
até 1856
já 1854
sem 1846
mas 1835
m 1834
essa 1813
doenças 1806
esse 1789
pública 1781
grande 1767
crianças 1767
total 1766
enfermagem 1765
todos 1759
desenvolvimento 1750
mortalidade 1739
modelo 1733
programa 1728
acesso 1725
pessoas 1717
podem 1712
meio 1711
pelos 1706
indivíduos 1701
diferentes 1688
base 1669
ações 1668
sexo 1667
condições 1665
peso 1664
tipo 1662
_ 1652
controle 1651
região 1650
//www 1640
ter 1638
c 1614
12 1613
rev 1585
aumento 1579
seus 1562
partir 1550
menor 1550
outras 1545
parte 1542
for 1533
adolescentes 1527
disponível 1524
11 1514
área 1492
sociais 1491
janeiro 1490
presente 1479
ano 1478
paciente 1478
vez 1473
suas 1473
paulo 1462
apresentaram 1460
características 1459
outro 1459
municípios 1452
menos 1452
sido 1448
valores 1446
seja 1446
amostra 1440
município 1437
diagnóstico 1424
realizado 1421
medicamentos 1404
6 1402
há 1401
20 1399
está 1396
maioria 1394
s 1388
thumbnail 1386
consumo 1383
muito 1380
associação 1379
neste 1379
esta 1372
assistência 1367
? 1366
atendimento 1366
têm 1360
https 1349
prática 1347
idosos 1346
informação 1341
utilização 1338
óbitos 1331
importante 1329
dias 1323
objetivo 1321
família 1308
15 1295
cuidado 1275
deste 1271
figura 1266
caso 1254
atividades 1254
realizada 1249
duas 1249
esses 1237
todas 1234
estão 1224
bem 1219
situação 1219
gov 1218
houve 1213
redução 1206
indicadores 1201
fato 1196
presença 1182
vezes 1178
l 1177
alguns 1174
vigilância 1165
atividade 1158
r 1140
homens 1140
escolaridade 1134
necessidade 1132
possível 1128
parto 1113
onde 1112
ic95 1105
básica 1105
& 1102
acordo 1100
problemas 1100
causas 1100
pois 1099
8 1098
quais 1093
câncer 1088
renda 1086
internet 1084
geral 1081
tanto 1079
cinco 1074
meses 1074
quatro 1073
eu 1067
d 1061
7 1059
apesar 1058
b 1056
física 1054
conhecimento 1048
áreas 1038
dessa 1036
estatística 1034
qual 1033
era 1030
30 1028
saude 1027
unidades 1022
literatura 1021
sus 1020
instrumento 1014
22 1013
distribuição 1008
produção 1007
final 1003
hospital 1002
organização 1001
to 993
diferença 987
18 987
n 986
melhor 984
primeiro 984
recursos 977
nesse 974
estados 971
desses 970
alimentar 968
país 968
maiores 961
baixa 960
valor 955
importância 955
coleta 955
aspectos 953
teste 951
serviço 949
embora 946
violência 946
contexto 943
realização 941
local 934
avaliar 930
medidas 930
participação 930
criança 926
2010 923
níveis 923
14 923
países 922
alta 921
causa 916
revisão 915
trabalhadores 914
9 913
itens 913
deve 911
dor 909
autores 907
desse 907
método 902
diferenças 902
19 897
sul 897
políticas 896
brasileiro 895
federal 894
ocorrência 894
13 893
eram 891
profissional 891
enquanto 890
isso 890
faixa 886
pelas 885
instituto 882
política 882
participantes 881
i 879
16 874
secretaria 872
prevenção 870
essas 869
brasileira 867
tais 859
principalmente 858
fator 855
modo 853
regiões 853
proporção 847
portanto 847
brasília 845
cuidados 845
através 844
rede 842
entretanto 839
resultado 838
critérios 836
equipe 835
primeira 829
silva 828
25 826
2012 822
hospitalar 818
2015 818
escala 817
citado 812
porém 809
índice 808
utilizado 806
principais 805
taxas 804
hospitais 804
variável 802
superior 801
respectivamente 801
segurança 801
familiar 799
usuários 797
cobertura 796
unidade 796
disso 796
apresentou 794
efeito 793
apresenta 788
ambiente 788
longo 788
momento 788
pré-natal 788
questões 781
universidade 781
campo 780
baixo 780
24 777
métodos 775
algumas 768
17 766
2013 764
exemplo 762
on 761
práticas 760
devido 760
relacionados 757
desta 757
conforme 756
taxa 756
eles 751
medida 751
estes 750
artigo 750
mães 747
percentual 746
menores 745
relações 745
padrão 742
apoio 742
médio 741
programas 740
perfil 739
t 738
2000 735
educação 732
médico 730
formação 729
intervenção 728
2020 728
associados 728
2014 728
tal 728
classificação 727
entanto 727
projeto 727
realizadas 723
grau 721
estar 720
versão 720
comparação 719
50 718
técnica 716
from 715
conjunto 714
crescimento 713
dia 712
etária 710
lado 709
utilizados 708
referência 708
sentido 708
incidência 705
cidade 705
exposição 705
demais 704
médicos 703
pontos 702
nº 702
desde 702
33 700
início 699
clínica 698
tendo 697
g 696
saúde; 696
cirurgia 695
alimentos 694
capacidade 693
horas 693
mulher 692
gestão 692
procedimentos 690
21 690
dentre 689
am 687
efeitos 687
sociedade 685
infecção 684
ensino 682
ele 679
cerca 678
fase 677
somente 676
drogas 676
mesma 675
óbito 672
ela 670
23 669
busca 669
mental 668
identificação 665
seis 664
principal 664
identificar 663
problema 662
gestação 662
devem 662
estratégias 661
realizados 660
resposta 660
discussão 659
adultos 659
único 657
bras 656
falta 656
outra 655
todo 654
condição 654
morte 654
jovens 653
obtidos 652
lesão 651
apresentam 650
antes 648
care 647
famílias 647
< 646
tendência 646
sob 646
função 644
aqueles 642
nutricional 642
animais 642
cad 640
álcool 640
2009 640
aplicação 636
60 636
significativa 635
estrutura 635
dessas 634
questão 634
mudanças 633
considerando 632
construção 632
global 631
serem 630
água 627
gestantes 626
comportamento 625
setor 625
análises 622
2011 621
44 619
departamento 619
mil 618
0 615
porque 614
enferm 610
feminino 608
mãe 608
relacionadas 606
obesidade 606
respeito 606
só 605
estratégia 604
diabetes 603
frequência 603
ação 600
situações 599
acima 597
alimentação 596
pouco 595
f 594
impacto 594
100 593
world 593
e/ou 592
procedimento 590
seguintes 589
sistemas 587
razão 586
observou-se 585
55 585
pesquisas 584
categoria 582
categorias 580
tiveram 579
fim 579
experiência 579
espécies 577
40 575
2016 575
neonatal 575
ponto 574
encontrados 573
2008 572
med 568
considerados 567
acompanhamento 566
diversos 563
contra 563
doi 562
percepção 561
sexual 561
qualquer 560
2004 559
possibilidade 558
perda 558
complicações 557
org/10 557
utilizada 556
alto 554
processos 553
observado 553
dificuldades 553
with 553
poder 551
registro 551
ausência 550
teve 549
internação 548
público 548
vários 548
2019 547
br 546
alterações 545
primária 544
pdf 543
planejamento 541
2003 539
materna 539
ética 538
equipes 536
sim 535
questionário 534
humanos 534
tuberculose 534
coletiva 533
brazil 532
ocorreu 531
dez 531
muitas 531
populacional 530
corporal 529
sintomas 529
entrevistados 528
plano 527
públicas 525
correlação 525
investigação 524
familiares 523
vista 522
mostrou 522
centro 522
papel 522
medicina 522
espaço 521
abordagem 521
quadro 521
aids 521
importantes 519
acidentes 518
dificuldade 516
indivíduo 516
maneira 515
k 515
28 512
dentro 511
submetidos 511
necessário 511
masculino 510
observada 509
associada 508
diminuição 508
study 508
//doi 508
ambos 507
gênero 507
últimos 507
analisados 505
oliveira 502
mundial 502
direitos 502
intervenções 500
residentes 500
dimensões 500
implantação 500
médica 498
locais 497
instrumentos 497
mundo 496
analisar 495
brasileiros 495
estatisticamente 491
definição 491
novos 490
regressão 489
lesões 489
nessa 488
mm 487
nova 487
2006 486
modelos 485
tabagismo 485
 484
sempre 483
26 483
instituições 482
registros 481
artigos 481
geografia 480
66 480
especialmente 480
internações 479
cm 478
77 478
nascimento 477
fundamental 477
proteção 476
hiv 476
considerado 475
estas 474
sobrevida 473
norte 472
materno 470
27 470
proposta 469
então 469
achados 468
necessidades 468
gerais 465
santos 465
pessoa 465
2007 464
99 464
unidos 463
88 463
diversas 460
isto 460
acessado 459
available 459
realidade 459
nesta 457
compreensão 457
or 456
nem 455
central 455
técnicas 454
tipos 454
entrevistas 454
desempenho 454
tinham 454
exame 454
ii 453
promoção 453
série 452
fazer 452
significância 452
seria 452
aborto 452
1998 450
comunidade 448
bucal 448
semanas 447
contudo 446
cirúrgico 446
elevada 445
2005 444
imc 444
confiança 444
objetivos 444
escola 444
grandes 443
sete 442
enfermeiros 442
comum 442
escore 441
segunda 440
nosso 440
formas 440
95 440
boa 439
estavam 439
who 439
nascidos 439
inferior 438
respostas 438
2018 438
29 437
80 436
ocorre 435
2002 434
considerada 434
crônicas 433
filhos 433
pressão 433
destes 433
estudantes 432
concentração 432
h 431
direito 431
1996 430
comitê 428
2014; 428
conteúdo 428
precoce 427
existência 427
transmissão 427
carga 426
associado 425
década 425
utilizadas 424
variação 424
nordeste 424
utilizando 423
possíveis 422
2017 420
dimensão 419
inclusão 417
atuação 417
aproximadamente 417
clínicos 416
apresentados 416
clínicas 415
exames 415
termo 413
internacional 413
introdução 412
seleção 412
corpo 412
indicador 412
sujeitos 412
contato 411
história 411
1999 411
novas 410
evolução 410
satisfação 410
2015; 410
1997 409
v 409
públicos 409
perspectiva 409
âmbito 408
tema 408
validade 407
concordância 406
vivos 406
infantil 406
influência 405
feita 405
lazer 405
trabalhos 404
via 404
elas 403
amostras 403
freqüência 403
riscos 402
muitos 401
35 401
populações 401
associadas 400
disponíveis 400
mudança 399
mínimo 399
2001 399
grave 398
transversal 398
prevalências 398
diagnósticos 398
clínico 398
consultas 397
aqui 397
municipal 396
data 396
quase 396
verificou-se 395
pós-operatório 394
vem 393
quantidade 393
própria 392
demanda 391
review 391
realizar 391
disponibilidade 390
existe 390
algum 390
habitantes 390
agentes 390
sejam 389
ansiedade 389
apresentar 388
domicílios 388
70 387
morbidade 387
termos 386
notificação 386
interesse 385
material 384
cultura 384
verificar 382
inicial 382
comunicação 382
etapa 381
diante 381
amamentação 381
metodologia 380
parâmetros 379
anterior 378
melhoria 378
excesso 378
igual 377
lei 377
individual 376
avaliados 376
implementação 376
gravidez 375
hospitalares 375
indígenas 375
domicílio 373
epidemiol 373
normas 373
consideradas 372
fraturas 372
toda 371
tamanho 371
semelhante 369
movimento 369
1010 368
referentes 367
me 367
permite 366
responsáveis 366
encontrada 366
oito 366
decisão 365
mercado 365
limitações 364
entrevista 364
2012; 364
an 363
1990 362
padrões 362
comportamentos 362
la 362
31 362
eventos 361
1111 361
depois 361
conta 360
diário 360
atual 360
1993 360
45 359
pernambuco 358
presentes 357
encontradas 357
among 357
estadual 357
nursing 357
validação 356
evidências 356
elaboração 356
pais 356
posição 355
centros 355
seguida 353
livre 352
relataram 352
90 350
trauma 350
monitoramento 349
2013; 349
minutos 349
relacionada 349
especial 348
individuais 347
uti 347
horizonte 346
public 346
arterial 346
pessoal 346
responsável 345
nenhum 344
residência 344
escolar 344
2011; 343
adequado 343
faz 343
humano 343
escolha 341
mediante 341
adolescente 341
1313 340
sobretudo 340
adequação 340
poderia 340
escores 340
ibge 339
semelhantes 339
minas 339
próprio 339
médias 338
mostra 338
casa 338
conceito 338
confiabilidade 338
incluindo 337
trata-se 337
instituição 337
potencial 336
produtos 336
x 336
critério 336
cálculo 336
capital 336
iii 336
físico 335
bastante 335
consulta 335
filho 335
cirúrgica 334
adequada 334
identificados 332
aspecto 332
coeficiente 332
diretamente 331
ciênc 330
semana 330
1515 330
havia 329
selecionados 329
resistência 329
bom 328
último 328
econômica 328
custo 328
1212 328
princípios 328
utilizou-se 327
y 327
considerar 327
nacionais 327
conselho 326
banco 326
intervalo 325
normal 325
determinantes 325
custos 325
manutenção 325
testes 324
1414 324
desfecho 324
fora 324
períodos 323
ma 323
positiva 323
sangue 323
elementos 323
elevado 322
32 322
campos 321
autonomia 321
observa-se 320
homem 320
mostraram 319
membros 319
souza 319
ed 319
novo 319
nascer 319
suicídio 319
externas 319
técnicos 318
adesão 318
mortes 318
observação 317
dado 317
organization 317
zona 317
observadas 316
parece 316
numa 316
oms 316
registrados 316
interpretação 315
adaptação 315
inquérito 315
tenha 315
oficial 315
óssea 315
apresentavam 314
existem 314
cancer 314
renal 314
mostram 313
pele 313
acerca 313
deles 313
definida 312
componentes 312
transporte 312
massa 311
duração 311
manual 311
sinais 311
bases 311
etapas 310
34 310
bahia 310
visto 309
significante 308
num 308
natureza 307
representa 307
aquelas 307
int 306
suppl 306
células 306
alguma 305
vítimas 305
1616 305
hipertensão 304
significativamente 304
000 304
dose 304
1995 303
belo 303
mc 303
cenário 303
comparados 302
difícil 302
força 302
inicialmente 301
desigualdades 301
estudados 301
complexidade 301
preenchimento 301
­ 301
desenvolvido 300
científica 300
pesquisadores 300
experiências 300
39 299
1818 298
setores 298
união 298
use 298
saber 298
ml 297
síndrome 297
fundação 296
item 296
criação 296
sudeste 295
solo 295
resolução 295
risk 295
ciências 295
pontuação 295
observados 294
contribuir 294
inserção 294
agravos 294
medicamento 294
nurs 294
estresse 294
abaixo 294
metade 293
coorte 293
lugar 293
gente 293
idoso 293
específicas 292
crônica 292
cidades 292
epidemiológica 292
brasileiras 291
significativas 290
composição 290
exercício 290
básicas 290
tecnologia 290
visando 289
gestores 289
garantir 289
treinamento 288
ordem 288
enfrentamento 288
teoria 288
percentuais 288
governo 287
corte 287
componente 286
jr 286
scielo 286
classe 285
36 285
pode-se 285
mês 285
si 284
atendimentos 284
várias 283
posteriormente 283
participar 283
cited 283
você 283
obtenção 282
índices 282
envolvidos 282
fontes 282
frente 282
torno 281
perdas 280
reduzir 280
costa 280
1919 279
fonte 279
epidemiológico 279
insegurança 279
ratos 279
48 278
2010; 278
estimativas 278
altura 278
enfermeiro 278
porto 278
diretrizes 278
portadores 278
administração 278
probabilidade 278
escolares 278
dezembro 277
ac 277
tratamentos 277
1717 277
tecnologias 277
005 277
tecido 277
encontrado 277
protocolo 277
densidade 277
escolas 277
significativo 276
texto 276
possui 276
suporte 276
37 275
expressão 274
forte 274
refere 274
solução 274
mesmos 274
destas 273
1994 273
analisadas 272
ca 272
cuja 272
simples 271
transição 271
santa 271
terapia 271
ocorreram 271
interação 270
consentimento 270
> 270
possuem 270
epidemiológicos 270
apontam 270
ubs 270
pelotas 270
linha 270
tinha 269
ms 269
benefícios 269
aleitamento 269
2121 268
obtidas 268
ósseo 268
geralmente 267
orientação 267
factors 267
gestacional 267
última 267
ensaios 267
mato 267
desenvolvidos 266
associações 266
grosso 266
± 265
face 264
civil 264
infecções 264
anteriores 263
melhores 263
aprovado 263
físicas 263
estava 263
mg 263
direta 262
utilizando-se 262
funcional 262
disease 262
alunos 262
financiamento 262
melhora 261
primeiros 261
tabaco 261
2016; 261
nossa 261
atualmente 260
coletados 260
interna 260
medo 260
relacionamento 260
nome 260
junto 259
terceiro 259
publica 259
saudável 259
danos 259
inclusive 258
conhecer 258
exclusão 258
transtornos 258
faculdade 258
operação 257
leite 257
regional 257
eficácia 257
mal 257
evitar 256
1992 256
recém-nascidos 256
analysis 255
relacionado 255
incluídos 255
lima 255
nutrição 255
debate 255
fragilidade 255
maio 254
estudada 254
participaram 254
status 254
carvalho 254
vai 254
patients 254
particularmente 254
redes 254
podendo 253
humana 253
objeto 253
espacial 253
dc 253
estabelecimento 253
aparelho 252
crescente 251
2222 251
melhorar 251
interior 251
gravidade 251
mediana 250
2323 250
original 250
diz 250
recomendações 250
distrito 250
anemia 250
oferta 249
específicos 249
curso 249
feito 249
epidemiologia 249
amostragem 248
seguimento 248
1991 247
existentes 247
considerando-se 247
classificados 247
temperatura 247
composta 246
faixas 246
urbana 246
equipamentos 246
emergência 246
notificados 246
receberam 245
geneva 245
espécie 245
2009; 244
legal 244
acessibilidade 244
vacinação 244
2017; 244
cárie 244
sensibilidade 244
cotidiano 243
bem-estar 243
ar 243
espaços 243
ajuste 242
relevante 242
origem 242
epidemia 242
laboratório 242
descrição 242
nenhuma 242
ambientais 242
control 242
intensidade 241
nove 241
tb 241
poucos 241
observar 241
porte 241
extensão 240
passo 240
provavelmente 240
depressão 240
mortality 240
obter 240
colo 240
vulnerabilidade 239
desenvolver 239
portaria 239
independente 239
almeida 238
vale 238
dependência 238
preocupação 238
seguir 237
49 237
tenham 237
nesses 237
caracterização 236
65 236
concepção 236
conceitos 236
fenômeno 236
previamente 235
experimental 235
psf 235
proposto 234
magnitude 234
perguntas 234
cultural 234
quem 234
fixação 234
princípio 234
relativa 233
indicam 233
capitais 233
vírus 233
privado 233
responsabilidade 233
gastos 233
abuso 233
detecção 232
independentes 232
saudáveis 232
conclusão 232
dengue 232
censo 231
específico 231
decisões 231
fratura 231
barreiras 231
imagem 230
estatísticas 230
trabalhador 230
prevalence 230
apresentado 230
rotina 230
aquisição 229
razões 229
compreender 229
estimar 229
promover 229
variou 228
quadril 228
cabe 228
transmissíveis 228
res 228
coordenação 228
usuário 228
única 227
hipótese 227
desafios 227
adoção 227
capaz 227
substâncias 227
barros 226
graves 226
ciclo 226
procura 226
estudadas 225
manter 225
sociodemográficas 225
rural 225
superiores 225
domínio 224
38 224
especialistas 224
sistemática 223
ressaltar 223
envolvendo 223
limitação 223
destaca-se 222
culturais 222
relativas 222
caráter 222
sobrepeso 222
foco 222
recuperação 222
avaliado 222
rs 222
décadas 222
propostas 222
– 221
rp 221
chance 221
cuidar 221
possam 221
milhões 221
ativa 220
referiram 220
deficiência 220
limites 220
43 220
esquistossomose 220
2424 219
orientações 219
datasus 219
poderiam 219
execução 219
recém-nascido 219
populacionais 219
desenho 219
1988 219
incorporação 219
linear 218
atores 218
dinâmica 218
indicação 218
hábitos 218
demandas 218
hoje 217
quality 217
comuns 217
projetos 217
anual 216
descrever 216
altas 216
constitui 216
nunca 216
oral 216
redação 216
recente 216
mecanismos 216
trânsito 216
estabelecimentos 216
municipais 216
correção 215
classes 215
seguro 215
sugere 215
sexos 215
41 215
abdominal 215
aguda 215
contribuição 215
visão 215
estratos 215
ampliação 215
máximo 214
obtida 214
realizou-se 214
national 214
proporções 214
recife 214
julho 213
+ 213
per 213
pior 213
software 213
integral 213
possa 213
emprego 212
mellitus 212
específica 212
todavia 212
organizações 212
funcionamento 212
preto 212
distância 211
reconhecimento 211
en 211
75 211
variações 211
relativos 211
mar 211
fluxo 211
discurso 211
df 210
partos 210
decorrentes 210
internacionais 210
positivos 209
levar 209
metropolitana 209
brazilian 209
relevância 209
obtido 209
conhecimentos 209
estabelecer 209
seguinte 209
triagem 209
levantamento 208
indica 208
território 208
clinical 208
acta 208
organization; 208
42 208
tão 208
sugerem 208
membro 207
ambas 207
delas 207
empresas 207
diária 207
excluídos 207
especificamente 207
evento 207
econômico 207
covid-19 207
sofrimento 207
erro 206
positivo 206
amostral 206
at 206
deve-se 206
completa 206
anteriormente 206
leitos 206
campinas 206
demonstraram 206
avaliações 206
necessária 205
localização 205
 205
apresentadas 204
vizinhança 204
pequena 204
research 204
nascimentos 204
dá 204
comunidades 204
amazônia 203
domiciliar 203
pequeno 203
ferramenta 203
comparadas 202
variando 202
século 202
torna-se 202
by 202
w 202
aumentar 202
ferreira 202
cor 202
científico 202
2008; 201
terem 201
domínios 201
dar 201
prescrição 201
determinação 200
época 200
selecionadas 200
capita 200
possibilidades 200
terapêutica 200
últimas 200
adolescência 200
composto 200
alteração 199
diferente 199
estimativa 199
comparado 199
gomes 199
passou 199
real 199
1980 199
motivo 199
fêmur 199
regular 198
permitiu 198
órgãos 198
andrade 198
relato 198
avaliada 197
infância 197
aps 197
clin 197
sp 197
aí 197
reflexão 197
elevadas 197
suficiente 197
doses 197
consistência 197
sentimentos 197
ganho 196
doentes 196
materiais 196
tecidos 196
new 196
moradores 196
avaliadas 196
emocional 196
apresentando 195
tomada 195
motivos 195
pra 195
mama 195
próximo 195
sala 195
relatório 195
destaque 194
rm 194
ap 193
desvio 193
idades 193
primeiras 193
segmento 193
” 193
59 193
gestante 193
incluídas 193
necessários 193
estilo 193
regionais 193
dp 193
dieta 192
momentos 192
associated 192
relatos 192
feitas 192
assistencial 192
março 191
entrada 191
proximal 191
systematic 191
elevados 191
excessivo 191
assessment 191
php 191
crítica 191
lista 191
indicando 190
prazo 190
junho 190
autor 190
mr 190
lm 190
logística 190
dada 190
ribeirão 190
mesmas 190
relevantes 190
cc 189
fases 189
ja 189
paraná 189
constante 189
intervalos 189
temas 189
localidades 189
atitudes 189
soc 188
frequente 188
report 188
esclarecido 188
tentativa 188
maternidade 188
concentrações 188
ocorrem 187
aplicado 187
ocorrer 187
ferro 187
auxílio 187
2525 187
alegre 187
queda 187
fazem 187
sinan 187
hemodiálise 187
mentais 187
economia 186
possuíam 186
esteve 186
demográficas 186
parede 186
distal 185
tratados 185
especificidade 185
survey 184
identificadas 184
ocupação 184
movimentos 184
aumenta 184
alimentares 184
temática 184
múltiplas 184
hora 184
posterior 183
volume 183
lancet 183
dm 183
descritivo 183
desafio 183
sexuais 183
sífilis 183
tentativas 183
desenvolvidas 183
ambulatorial 183
interações 183
fumantes 183
genética 183
aumentou 182
acs 182
cujo 181
produto 181
estudado 181
vínculo 181
planos 181
utilizar 181
catarina 181
sucesso 181
efetividade 181
opção 180
46 180
determinado 180
privados 180
sanitária 180
será 179
baseada 179
comprimento 179
exclusivamente 179
variância 179
ruim 179
permitindo 179
experimento 179
particular 179
característica 178
! 178
ocorridos 178
realizaram 178
vascular 178
integração 178
atendidos 178
articulação 178
expansão 178
popular 178
escalas 178
erros 177
discriminação 177
complexo 177
logo 177
estimada 177
deveria 177
determinar 177
distintos 176
development 176
delineamento 176
demonstrou 176
terceira 176
contextos 176
agente 176
esf 176
floresta 175
estatístico 175
inferiores 175
publicações 175
56 175
possivelmente 175
ambientes 175
determinada 175
relativamente 175
rua 175
sexualidade 175
inclui 174
ácido 174
etárias 174
2006; 174
0001 174
transtorno 174
preciso 174
qualitativa 174
vêm 173
natural 173
independentemente 173
inquéritos 173
externa 173
coeficientes 173
amazonas 173
equivalência 173
descrito 172
incapacidade 172
dependente 172
2626 172
socioeconômicas 172
achado 172
manejo 172
doente 172
fatorial 172
animal 171
aa 171
verificação 171
fácil 171
finalidade 171
evidência 171
cursos 171
editora 171
ingestão 170
permanência 170
apresentação 170
tudo 170
diversidade 170
recentes 170
explicar 170
físicos 170
rodrigues 170
jun 170
ambiental 170
pares 169
terço 169
envelhecimento 169
aprovação 169
nossos 169
women 169
múltipla 169
precisa 169
food 169
pereira 169
funções 169
near 169
ciência 169
investigar 169
cabeça 169
descritiva 168
seres 168
ampla 168
ad 168
depende 168
eficiência 168
identidade 168
máxima 167
pergunta 167
significa 167
aponta 167
recebido 167
miss 167
altos 167
entrevistadas 167
responder 167
tratar 167
déficit 167
freqüente 167
passos 167
ea 167
indígena 167
águas 167
envolve 166
leitura 166
minha 166
sinasc 166
practice 166
comparar 166
distintas 165
54 165
≥ 165
fosse 165
aconselhamento 165
usp 165
médicas 165
haviam 165
iv 165
r$ 165
segmentos 164
is 164
constituem 164
colet 164
síntese 164
52 164
salários 164
indústria 164
asma 164
etc 163
consideração 163
frequentes 163
2007; 163
life 163
//bvsms 163
destacar 163
bairros 163
47 163
placa 163
temporal 162
tempos 162
auxiliar 162
bebidas 162
sítio 162
significado 161
utilizaram 161
qui-quadrado 161
puérperas 161
bebê 161
prevention 161
72 161
congênita 161
passa 161
direção 160
provenientes 160
joelho 160
adversos 160
encontraram 160
interesses 160
lateral 160
representações 159
cruz 159
cl 159
fizeram 159
consenso 159
próprios 159
estruturas 159
técnico 159
revelou 159
manifestações 159
demonstram 159
seriam 159
eixo 159
espera 159
desigualdade 158
araújo 158
referido 158
identificado 158
parcela 158
protocolos 158
mb 158
consiste 158
viés 158
spss 158
meios 158
participou 158
respectivos 158
investigações 158
garantia 158
definido 157
questionários 157
baseado 157
mostrou-se 157
estabilidade 157
portuguese 157
essencial 157
avanços 157
serv 157
refere-se 157
doméstica 157
agosto 156
haver 156
sm 156
comportamentais 156
educativas 156
cuidadores 156
capacitação 156
nessas 156
usado 156
branca 156
org 156
gasto 156
contribuiu 155
atendidas 155
drug 155
conduta 155
capazes 155
chances 155
mínimos 154
representam 154
bolsa 154
econômicas 154
mf 154
fica 154
ademais 154
contendo 154
deslocamento 154
university 154
pai 154
zero 153
estágio 153
pouca 153
jm 153
declínio 153
geográfica 153
ribeiro 153
esforços 153
talvez 153
responderam 153
salvador 153
outubro 152
aplicada 152
américa 152
desfechos 152
esforço 152
paul 152
usados 152
contrário 152
maranhão 152
histórico 151
revista 151
nutr 151
defeitos 151
entendimento 151
demonstrado 151
moderada 151
adoecimento 151
1989 151
plantas 151
fortemente 150
sugerindo 150
permitem 150
ruptura 150
mecanismo 150
decorrente 150
corresponde 150
gordura 150
tobacco 150
descritos 150
palavras 150
cólon 150
analisado 149
ajustada 149
consequentemente 149
51 149
2727 149
69 149
esperado 149
esc 149
humanização 149
coletadas 149
frutas 149
opinião 149
predomínio 149
tumores 149
levando 148
rastreamento 148
útero 148
ver 148
martins 148
63 148
havendo 148
1987 148
ficha 148
professores 148
2018; 148
acidente 148
meu 148
cr 148
propriedades 147
matriz 147
seguido 147
estágios 147
considerou-se 147
stata 147
prognóstico 147
decorrência 147
osso 147
53 147
reabilitação 147
permitir 146
agricultura 146
encontrou 146
ato 146
ocupacional 146
cigarros 146
desenvolvida 146
cateter 146
idéia 146
salud 146
cumprimento 146
torna 145
publicação 145
aquela 145
bloco 145
notificações 145
consolidação 144
velocidade 144
necessárias 144
adulta 144
pobreza 144
frequentemente 144
metas 144
aumentando 144
inadequado 144
intensiva 144
equilíbrio 144
ph 144
institucional 144
podemos 144
permanente 144
publicados 144
divisão 144
bairro 144
superfície 143
negativos 143
eficaz 143
intenção 143
meninas 143
abusivo 143
biológicos 143
adotado 143
maternal 143
system 143
contribuem 143
abordagens 143
completo 143
utilizou 143
ra 143
mensal 143
contínua 143
2005; 143
efetiva 143
dentária 143
enfermeira 143
trabalhar 143
centro-oeste 143
identificada 142
similar 142
empresa 142
explicação 142
adults 142
estatística; 142
van 142
sedentarismo 142
terapêutico 142
gerar 142
64 142
comprometimento 142
cardiovascular 142
lógica 142
teórico 142
serão 142
declaração 142
sobrevivência 142
tradução 142
novembro 141
05 141
comparada 141
oswaldo 141
acolhimento 141
ênfase 141
abrangência 141
complementar 141
tumor 141
utilizam 141
universal 141
may 141
1986 141
amigos 141
insuficiência 141
children 141
cigarro 141
modificações 140
abandono 140
expressa 140
2828 140
aquele 140
referente 140
considera 140
verificado 140
universitário 140
documentos 140
retorno 140
definidos 140
cicatrização 140
reação 140
prevenir 140
virtude 140
precisão 140
deveriam 140
totalmente 140
imagens 139
opções 139
avaliaram 139
physical 139
child 139
positivas 139
calculado 139
feminina 139
pós-graduação 139
optou-se 139
impactos 139
international 139
encontra-se 139
bullying 139
processamento 138
observou 138
tendências 138
limite 138
between 138
intestinal 138
demonstra 138
incluem 138
recentemente 138
expostos 138
tomar 138
cafeína 138
intuito 137
negativa 137
enfermeiras 137
constituição 137
contribuindo 137
vias 137
reprodução 137
usando 136
energia 136
body 136
distúrbios 136
continuidade 136
possibilita 136
sujeito 136
bmc 136
parcial 136
submetido 136
sócio-econômicas 136
odontológicos 136
definidas 136
leva 135
descritas 135
diminuir 135
contribui 135
ajuda 135
demográfico 135
receber 135
oportunidade 135
fins 135
fazendo 135
vegetação 134
z 134
cuidador 134
observaram 134
fumar 134
discussões 134
paulista 134
distribuídos 134
freqüentemente 134
parceiro 134
pobres 134
abril 134
conseqüências 134
cardiovasculares 134
sobrecarga 134
1º 133
pc 133
atuam 133
85 133
prontuários 133
daqueles 133
participante 133
alternativas 133
alcoólicas 133
registradas 133
descrita 132
consequências 132
significantes 132
tendem 132
reflete 132
nih 132
teixeira 132
alves 132
domiciliares 132
submetidas 132
produzidos 132
direto 132
implica 132
verificada 132
dentes 132
farmacêutica 132
colágeno 132
curto 131
fernandes 131
fez 131
vigitel 131
incluiu 131
ressalta-se 131
proporcional 131
reprodutiva 131
básicos 131
elemento 131
poderá 131
dcnt 131
exceção 131
guia 131
trinta 131
localizados 131
refletir 131
passaram 131
porcentagem 131
2003; 130
formulação 130
requer 130
resultando 130
cid-10 130
luz 130
demonstrando 130
usuárias 130
graduação 130
conseqüentemente 130
baixos 130
malária 130
curva 129
próximos 129
fio 129
essenciais 129
pnad 129
envolvimento 129
rápido 129
primary 129
ss 129
vistas 129
voltadas 129
autocuidado 129
sc 129
estabelecidos 129
relativo 129
secundários 129
malta 129
éticos 129
freqüentes 129
atender 129
visitas 129
elevação 129
graus 128
recurso 128
identificou 128
mostrando 128
vantagens 128
atuais 128
rj 128
institucionais 128
financeiro 128
seguindo 128
observações 128
legislação 128
buscando 128
vinte 128
minimizar 127
68 127
totalizando 127
sci 127
diseases 127
estabelecido 127
acompanhante 127
jovem 127
medicação 127
57 127
coletivo 127
idosa 127
assistenciais 127
correlações 127
habilidades 127
docentes 127
farmácia 127
alfa 126
adequados 126
ressecção 126
gástrico 126
500 126
62 126
cirurgias 126
2929 126
ficou 126
monteiro 126
association 126
nlm 126
prematuro 126
coisa 126
120 126
calculada 126
financeiros 126
língua 126
verifica-se 126
tese 126
iniciativa 126
fala 126
certa 126
esôfago 126
imediato 125
prótese 125
anastomose 125
marcha 125
meninos 125
jl 125
obesity 125
ncbi 125
ramos 125
jc 125
cujos 125
58 125
verbal 125
cidadania 125
rurais 125
dizer 125
amplamente 124
sono 124
terapêuticas 124
representar 124
alcohol 124
plos 124
psicológico 124
estudar 124
constatou-se 124
potencialmente 124
tabelas 123
obtiveram 123
leve 123
proteína 123
apresentada 123
traz 123
implicações 123
propósito 123
combinação 123
estrato 123
200 123
61 123
cargas 123
provável 123
analisada 123
fortaleza 123
atributos 122
avançado 122
finalmente 122
metabólica 122
núcleo 122
kg 122
setembro 122
ec 122
jg 122
validation 122
celular 122
preparo 122
blocos 122
múltiplos 122
reduzido 122
eletrônico 122
investigados 122
bancos 122
iniciativas 122
conflitos 122
industrial 122
discursos 122
restrição 121
igualmente 121
pregnancy 121
pós-parto 121
dr 121
atingir 121
fundo 121
haja 121
nutricionais 121
citados 121
exceto 121
político 121
transformações 121
safety 121
significados 121
ago 121
doadores 121
mínima 120
work 120
effects 120
index 120
português 120
parecer 120
cs 120
evaluation 120
odontologia 120
surgimento 120
policy 120
definições 120
fragmentos 120
agrotóxicos 120
dispõe 120
fundamentais 120
pessoais 120
predominância 120
agora 120
ativos 120
naturais 120
agência 119
definir 119
residente 119
longitudinal 119
heterogeneidade 119
apresentarem 119
predominantemente 119
ir 119
ficar 119
praticamente 119
zika 119
nota 119
estaduais 119
hiv/aids 119
reações 119
burnout 119
usar 119
chagas 119
multivariada 118
alternativa 118
rc 118
muscular 118
futuro 118
trata 118
discutir 118
fornecer 118
linhas 118
breastfeeding 118
ideal 118
consciência 118
estação 117
seca 117
médios 117
estiveram 117
permaneceram 117
objetos 117
positivamente 117
observamos 117
frequências 117
gêneros 117
rocha 117
acho 117
buscar 117
companheiro 117
números 117
anos; 117
professor 117
contaminação 117
femoral 117
maternidades 117
ampliar 117
formal 117
medical 117
despesa 117
doação 117
transferência 116
sousa 116
el 116
constituída 116
informática 116
cujas 116
nada 116
entender 116
comissão 116
obteve 116
1985 116
troca 116
potenciais 116
pará 116
liberdade 116
vs 115
produzir 115
canadá 115
dúvidas 115
76 115
profilaxia 115
pertencentes 115
integralidade 115
governamentais 115
human 115
documento 115
competência 115
74 115
histórica 115
competências 115
scale 115
travestis 115
roraima 114
expectativa 114
expressiva 114
rotação 114
resultou 114
combate 114
apresentava 114
comumente 114
frança 114
internados 114
passando 114
quarto 114
desnutrição 114
impact 114
representação 114
complexa 114
2000; 114
modalidades 114
educ 114
reforma 114
sentimento 114
comercial 114
pequenas 113
geração 113
prévia 113
3030 113
ativo 113
burden 113
realizou 113
using 113
estímulo 113
útil 113
controles 113
classificadas 113
suplementação 113
necessitam 113
organizadores 113
perfis 113
manaus 113
divididos 112
sabe 112
67 112
rápida 112
partes 112
dst 112
smoking 112
estabelece 112
conceitual 112
determinados 112
quinto 112
tecnológico 112
julgamento 112
lidar 112
construído 112
diabéticos 112
respiratórias 112
leishmaniose 112
δ 112
genéricos 112
oficiais 111
caracterizar 111
falha 111
vertical 111
cirúrgicos 111
influenciar 111
perspectivas 111
insuficiente 111
elaborado 111
humanas 111
condutas 111
encontrar 111
0000 111
lá 111
reconhecer 111
referida 111
salário 111
totalidade 111
fumo 111
poucas 111
neoplasias 111
geográficas 111
socialmente 111
árvores 111
utiliza 110
transformação 110
negativo 110
atribuída 110
alimento 110
evidente 110
empregados 110
cardíaca 110
baixas 110
valorização 110
compra 110
existente 110
econômicos 110
fevereiro 110
co2 110
claro 110
moradia 110
alvo 110
students 110
determinadas 110
representando 110
sr 110
reais 110
pensar 110
vi 110
transplante 110
fa 109
estabelecidas 109
proteínas 109
endereço 109
001 109
desejo 109
population 109
recebeu 109
lopes 109
simultaneamente 109
adequadas 109
jul 109
microcefalia 109
abastecimento 109
algo 109
bens 109
incremento 109
quer 109
agenda 109
oportunidades 109
terapêuticos 109
encontram 109
totais 109
ceará 109
universitários 109
vacinas 109
neoplasia 109
implante 109
ceo 109
2004; 108
madeira 108
compõem 108
comorbidades 108
flexão 108
conjugal 108
teor 108
during 108
atribuído 108
divulgação 108
doutorado 108
preventivas 108
adequadamente 108
u 108
referencial 108
comunitários 108
acre 108
atitude 108
folhas 108
york 108
indicaram 107
próxima 107
one 107
prontuário 107
qualificação 107
alcançar 107
eqüidade 107
experimentais 107
agricultores 107
soluções 107
estruturais 107
anticorpos 107
1999; 106
censitários 106
mostrado 106
fetal 106
outcomes 106
subsidiar 106
básico 106
especialidades 106
evidenciou 106
parâmetro 106
esquema 106
hortaliças 106
santo 106
assunto 106
precisam 106
etário 106
urgência 106
josé 106
nestes 106
american 106
vitamina 106
carcinoma 106
2002; 105
clima 105
encontram-se 105
confusão 105
apontaram 105
recomendação 105
morbimortalidade 105
tardio 105
chronic 105
pré 105
manuais 105
linguagem 105
facilitar 105
contribuições 105
sabe-se 105
glicemia 105
epi 105
avanço 105
aceitação 105
possibilitando 105
deu 105
produtividade 105
ga 105
js 105
laboratórios 105
passagem 105
respiratório 105
defesa 104
enfoque 104
aproximação 104
baseados 104
hábito 104
coortes 104
2021 104
af 104
mecânica 104
ensaio 104
encontra 104
aferição 104
postos 104
tarefas 104
empregado 104
mensuração 104
pesquisador 104
clientela 104
circunstâncias 104
encontro 104
próprias 104
inglês 104
universo 104
adulto 104
envolvem 104
cenários 104
preços 104
nurse 104
vieira 104
frutos 104
joão 103
correspondente 103
diâmetro 103
mt 103
elderly 103
ocasião 103
pearson 103
cardoso 103
significativos 103
szwarcwald 103
anestesia 103
tubo 103
tíbia 103
descentralização 103
transcultural 103
exige 103
diálise 103
fortalecimento 103
auto-avaliação 103
similares 103
acurácia 103
privada 103
patologia 103
 103
difusão 103
adolescents 103
barbosa 102
exposto 102
operados 102
constituído 102
ic 102
localizado 102
alcance 102
febre 102
padronização 102
unidas 102
contagem 102
revelam 102
amplo 102
incentivo 102
posicionamento 102
soro 102
piauí 102
patient 102
150 102
retirada 101
piores 101
iniciais 101
treatment 101
juízes 101
sih/sus 101
fecundidade 101
infecciosas 101
96 101
séries 101
ilha 101
amplitude 101
contínuo 101
prestação 101
machado 101
relatórios 101
funcionários 101
auxiliares 101
oeste 101
quantitativa 100
predominante 100
variabilidade 100
passado 100
comparações 100
cohort 100
raça/cor 100
coisas 100
diálogo 100
postura 100
liberação 100
conseqüência 100
suplementos 100
castro 100
sa 100
estatísticos 100
prévio 100
cura 100
violências 100
peixes 100
nutrientes 99
student 99
suplementar 99
exercícios 99
ia 99
vivo 99
favorável 99
medular 99
intensa 99
possuía 99
vacina 99
pesos 99
registrado 99
políticos 99
referências 99
78 99
tegumentar 99
primário 99
notas 99
correspondendo 98
muita 98
negativas 98
versus 98
usada 98
olhar 98
usadas 98
falar 98
morrer 98
estigma 98
reduzida 98
psicológica 98
boca 98
propõe 98
prematuridade 98
1984 98
violence 98
moral 98
absorção 97
fração 97
secundária 97
correspondência 97
gástrica 97
normais 97
antropométricas 97
evidence 97
telefônico 97
maternas 97
infant 97
atuar 97
depoimentos 97
código 97
posições 97
detectar 97
1970 97
virus 97
cefálico 97
isolamento 97
nações 97
hospitalização 97
urbano 97
falas 97
dela 97
regras 97
expectativas 97
pmaq 97
organizacional 97
trop 97
estadiamento 97
terra 96
excelente 96
tende 96
inerentes 96
possuir 96
crenças 96
activity 96
km 96
expostas 96
83 96
indicar 96
escassez 96
crítico 96
assegurar 96
ocorrido 96
estratégicas 96
preservativo 96
people 96
afirmar 96
subnotificação 96
fome 96
opiniões 96
respiratória 96
mucosa 96
injury 96
profissão 96
fumaça 96
ocorrendo 95
tornar 95
estômago 95
diferentemente 95
jp 95
adotada 95
obstet 95
vão 95
metodológico 95
73 95
mendes 95
concluíram 95
p<005 95
causar 95
compressão 95
adotados 95
gonçalves 95
bacteriana 95
re 95
freitas 95
mão 95
sensação 95
medir 95
calculadas 95
mestrado 95
necessariamente 95
reflexões 95
urbanos 95
1979 95
kappa 94
umidade 94
pé 94
novamente 94
órgão 94
countries 94
lc 94
azevedo 94
influenciam 94
lat 94
completude 94
especiais 94
incluir 94
rotinas 94
dis 94
visita 94
substituição 94
services 94
studies 94
laboratorial 94
2020; 94
infectados 94
sentidos 94
certo 94
revelaram 94
aleatória 94
estimado 94
balança 94
longa 94
solidariedade 94
raiva 94
tumoral 94
portarias 94
varia 93
evidencia 93
ajustadas 93
neonatais 93
relatado 93
md 93
interferência 93
extremamente 93
continua 93
saneamento 93
press; 93
91 93
química 93
agrupados 93
community 93
respectivas 93
crise 93
dependentes 93
quantitativo 93
tensão 93
representatividade 93
matéria 93
mobilidade 93
revela 93
conselhos 93
equação 93
droga 93
bebês 93
tela 93
gerando 92
aplicados 92
explicada 92
figuras 92
dúvida 92
conglomerados 92
3131 92
cunha 92
ler 92
federação 92
higiene 92
parecem 92
tecnológica 92
investimentos 92
gera 92
china 92
envolvidas 92
vivem 92
nasf 92
nós 92
statistical 92
tradicionais 92
estarem 92
pain 92
ocupacionais 92
auditiva 92
09 92
distritos 92
cronbach 92
bons 91
complicação 91
fossem 91
conduzido 91
correspondentes 91
poisson 91
recomendado 91
125 91
diárias 91
conhecida 91
socioeconômico 91
comparando 91
futuras 91
inadequada 91
eficiente 91
dispositivos 91
surgical 91
telefone 91
jan 91
letalidade 91
criar 91
ambulatório 91
contribuíram 91
prematuros 91
attitudes 91
has 91
influenza 91
psicossocial 91
esfera 90
estabelecida 90
aprendizado 90
clara 90
aposentadoria 90
aj 90
birth 90
maternos 90
pensamento 90
moura 90
textos 90
ambulatoriais 90
falhas 90
condução 90
particulares 90
referem 90
demográficos 90
confirmação 90
mata 90
dissertação 90
horário 90
entrevistado 90
evidenciado 90
intermédio 90
bruta 90
chama 90
insatisfação 90
miocárdio 90
reis 90
efluxo 90
transexuais 90
retalho 90
misoprostol 90
united 89
pa 89
fc 89
joelhos 89
sensorial 89
encontramos 89
education 89
reforça 89
management 89
mp 89
raça 89
cienc 89
facilidade 89
sutura 89
pré-operatório 89
estejam 89
//portal 89
utilidade 89
disseminação 89
fichas 89
auto-estima 89
simulação 89
demonstrar 89
marca 89
profundidade 89
hepática 89
kidney 89
painéis 89
out 89
incompletude 89
auditoria 89
qvrs 89
gálio 89
complementares 88
abertura 88
ocorridas 88
operatório 88
sociodemográficos 88
adicional 88
guidelines 88
ratio 88
morais 88
proporcionar 88
educativa 88
pós-operatória 88
neto 88
república 88
verdade 88
avançada 88
poderão 88
críticos 88
objetiva 88
laboratoriais 88
estimados 88
investigadas 88
implantado 88
inatividade 88
access 88
nervo 88
referidos 88
alencar 88
narrativas 88
ajudar 88
concepções 88
centrais 88
finais 88
emocionais 88
venda 88
vivência 88
vou 88
uf 88
regulação 88
trajetória 87
denominado 87
remoção 87
racional 87
age 87
role 87
verificou 87
destacam-se 87
construir 87
ct 87
representantes 87
considerações 87
fev 87
metodológica 87
saberes 87
inadequação 87
mj 87
imediatamente 87
parcialmente 87
cervical 87
júnior 87
infection 87
apreciação 87
afetam 87
justiça 87
oferecer 87
89 87
aparecimento 87
gc 87
morbidades 87
aperfeiçoamento 87
hemoglobina 87
1982 87
preservação 87
maus-tratos 87
percebe-se 87
01 86
variaram 86
ficaram 86
futuros 86
trends 86
orientar 86
desconhecimento 86
conteúdos 86
quadros 86
acute 86
esteja 86
suficientes 86
84 86
circulação 86
levou 86
congênitas 86
repercussões 86
narrativa 86
benefício 86
suspensão 86
estando 86
radioterapia 86
portuguesa 86
odontológica 86
brancos 86
hab 86
antibacterianos 86
br/scielo 86
tmc 86
buscam 85
amazônica 85
rios 85
registrada 85
oxford 85
articular 85
latina 85
representativa 85
baseadas 85
rr 85
multiprofissional 85
formato 85
avaliou 85
hipóteses 85
riqueza 85
fonseca 85
cg 85
92 85
identificaram 85
vantagem 85
confirmados 85
haste 85
nutrition 85
deixar 85
conclusões 85
pesquisadora 85
methods 85
pinto 85
fluxos 85
interessante 85
pe 85
rendimento 85
daí 85
fibras 85
despesas 85
medula 85
intoxicações 85
mídia 85
ecgl 85
absoluta 84
propostos 84
seguidos 84
colocação 84
elegíveis 84
assinaram 84
dec 84
educativo 84
sessões 84
their 84
teórica 84
reparo 84
128 84
especializados 84
relatados 84
habilidade 84
malformações 84
prioridade 84
adotadas 84
relacionamentos 84
estrutural 84
identificou-se 84
afastamento 84
98 84
periférica 84
constituir 84
2001; 84
family 84
knowledge 84
resumo 84
posto 84
paraíba 84
viabilidade 84
esmalte 84
visual 83
ligados 83
college 83
diminuiu 83
acredita-se 83
bivariada 83
processados 83
aprendizagem 83
html 83
vulneráveis 83
set 83
científicas 83
núcleos 83
tratadas 83
fixo 83
prioridades 83
fenômenos 83
pandemia 83
viver 83
percepções 83
motivação 83
sistêmica 83
quimioterapia 83
espírito 83
informados 83
obstáculos 83
localidade 83
tarefa 83
sex 83
sustentabilidade 83
estádio 83
csc 83
baseando-se 82
forças 82
marcadores 82
perceber 82
model 82
ae 82
epidemiology 82
retenção 82
//tabnet 82
pan-americana 82
próteses 82
operacional 82
corrente 82
caracterizada 82
passar 82
isquemia 82
necrose 82
pulmonar 82
comércio 82
melhorias 82
cliente 82
compostos 82
funcionais 82
efetivamente 82
consideram 82
2019; 82
escolhas 82
verificaram 82
del 82
dente 82
dentista 82
lf 82
privadas 82
decorrer 82
ats 82
1997; 82
parceiros 82
sementes 82
rl 82
marketing 82
importações 82
psicossociais 81
consistiu 81
criado 81
3232 81
early 81
weight 81
excluídas 81
es 81
urbanas 81
apontou 81
efetivo 81
validado 81
moreira 81
enxerto 81
medial 81
americana 81
sorologia 81
sócio-econômico 81
lb 81
biológico 81
q 81
cerebral 81
psicológicas 81
dele 81
imediata 81
teria 81
noção 81
resultante 81
indicado 81
prevalente 81
tenho 81
leis 81
negros 81
indicou 80
determinante 80
cirúrgicas 80
conhecido 80
visa 80
3333 80
mi 80
financeira 80
p<0001 80
meta 80
encontrou-se 80
atendida 80
07 80
teses 80
lhes 80
atribuição 80
hérnia 80
populares 80
bicicleta 80
literature 80
preferência 80
dispensação 80
policial 80
explicado 79
feitos 79
empregada 79
fígado 79
dividido 79
críticas 79
relatou 79
barreto 79
gender 79
favorecer 79
experience 79
especialidade 79
agudo 79
estimular 79
aberta 79
urina 79
equidade 79
adult 79
dispositivo 79
barreira 79
assistente 79
dispersão 79
passam 79
afirma 79
evidenciam 79
proximidade 79
sociedades 79
permanece 79
espaciais 79
aconteceu 79
relatam 79
resulta 79
mecânico 79
masculina 79
tuberculosis 79
stigma 79
porção 78
operações 78
convencional 78
vetores 78
dependendo 78
psicológicos 78
deficiências 78
exclusivo 78
cf 78
considerável 78
after 78
82 78
group 78
prestada 78
ortopedia 78
camada 78
agressão 78
infect 78
ali 78
clientes 78
supervisão 78
metodológicas 78
luta 78
levam 78
modalidade 78
horários 78
aleatoriamente 78
módulo 78
término 78
pequenos 78
orçamento 78
1983 78
aplicabilidade 77
próximas 77
europa 77
juntamente 77
fólico 77
caracterizado 77
gestações 77
nov 77
nunes 77
restante 77
administrativa 77
gerenciamento 77
normalmente 77
altamente 77
segura 77
vitais 77
81 77
lembrar 77
sanitário 77
71 77
claramente 77
coberturas 77
lp 77
naqueles 77
biológica 77
precocemente 77
religião 77
fatos 77
preocupações 77
hospitalizações 77
maria 77
papéis 77
soma 77
residências 77
metodologias 77
300 77
parceria 77
necessita 77
eficazes 77
teores 77
coluna 77
maturação 76
pico 76
considerou 76
menezes 76
puerpério 76
socioeconômicos 76
estável 76
melo 76
how 76
silveira 76
interferir 76
institui 76
naquele 76
focos 76
eliminação 76
minimamente 76
avalia 76
anvisa 76
estima-se 76
rb 76
emergências 76
teorias 76
controlar 76
chegar 76
atribuições 76
tem-se 76
turno 76
79 76
vínculos 76
young 76
xx 76
analisando 76
norma 76
caracteriza 76
especialização 76
atribuídos 76
ihac 76
culturas 75
ângulo 75
resultantes 75
variedade 75
migração 75
remunerado 75
dinheiro 75
completos 75
socioeconômica 75
administrativos 75
trato 75
mensagens 75
adaptation 75
educacional 75
pediatr 75
preparação 75
produzido 75
artéria 75
variam 75
vacinal 75
centers 75
prevalentes 75
legais 75
florianópolis 75
fármacos 75
moderado 75
first 75
93 75
contribuído 75
negociação 75
governamental 75
expressões 75
years 75
psicol 75
iguais 75
nota-se 75
operacionais 75
comprimidos 75
abuse 75
margem 74
acentuada 74
fraca 74
progressão 74
diferenciação 74
boletim 74
tido 74
diariamente 74
precoces 74
state 74
limitada 74
aparência 74
vontade 74
dl 74
epidemiológicas 74
códigos 74
seção 74
conseguinte 74
stress 74
descritores 74
dosagem 74
healthcare 74
orçamentos 74
are 74
ocorrências 74
moraes 74
afetar 74
preço 74
enfrentar 74
analisa 74
aparece 74
senso 74
faz-se 74
camargo 74
esquemas 74
parcerias 74
1996; 74
semântica 74
usando-se 74
digital 73
1998; 73
calculados 73
support 73
separação 73
classificada 73
úteis 73
nervoso 73
pinheiro 73
informar 73
screening 73
resultar 73
realizam 73
nery 73
bastos 73
death 73
eixos 73
captação 73
hepatite 73
leito 73
relatada 73
treinados 73
tradicional 73
atraso 73
academias 73
information 73
recusas 73
declararam 73
biológicas 73
tropical 73
indigenous 73
estaria 73
ligação 73
aderência 73
dificulta 73
reconhecida 73
genético 73
fornecimento 73
lhe 73
1978 73
acontece 73
farmacêuticos 73
percebida 73
aegypti 73
deverá 73
observa 73
artrite 73
aditivos 73
//dx 73
exploração 72
plataforma 72
correspondem 72
agrupamento 72
04 72
isoladamente 72
sanguínea 72
vítima 72
older 72
institute 72
modos 72
examinados 72
ai 72
online 72
iniciar 72
mh 72
surveillance 72
impossibilidade 72
realmente 72
câmara 72
evidenciando 72
eletrônica 72
esperada 72
vigente 72
preconizado 72
reforçam 72
uterino 72
sócio-econômicos 72
lee 72
viral 72
desvios 72
apontado 72
individualmente 72
povos 72
procuram 72
exclusiva 72
certamente 72
≤ 72
farmacêutico 72
intoxicação 72
surdez 72
agrupadas 71
estatura 71
formado 71
towards 71
aparentemente 71
characteristics 71
classificado 71
semanal 71
odds 71
formulário 71
sugestões 71
afirmaram 71
favoráveis 71
86 71
obstante 71
diminuindo 71
computador 71
diagnóstica 71
1981 71
mobilização 71
testar 71
perímetro 71
entidades 71
atingindo 71
negativamente 71
episódios 71
poluição 71
cotidiana 71
87 71
obteve-se 71
branco 71
1993; 71
independência 71
questionnaire 71
adversas 71
vm 71
adição 71
investimento 71
alocação 71
periódicos 71
pesados 71
interface 71
amarela 71
infarto 71
1016/j 71
aplicadas 70
classificações 70
fechamento 70
aumentado 70
contrapartida 70
97 70
perinatal 70
marques 70
desvio-padrão 70
intercorrências 70
subgrupos 70
insulina 70
cadeia 70
fios 70
territorial 70
dificultando 70
carência 70
action 70
localizada 70
latch 70
diarreia 70
refletem 70
pmaq-ab 70
inovação 70
especializado 70
evitáveis 70
prejuízo 70
pressões 70
mim 70
2ª 70
visibilidade 70
autorrelato 70
pense 70
secretarias 70
mansoni 70
retalhos 70
fluvial 70
quantificação 69
conversões 69
exploratória 69
adicionalmente 69
representaram 69
disse 69
jf 69
esclarecimento 69
alívio 69
né 69
pg 69
ce 69
ab 69
fmrp-usp 69
transplantes 69
3º 69
constatação 69
preventivos 69
população-alvo 69
interrupção 69
globais 69
tr 69
abr 69
mapa 69
científicos 69
federais 69
subsídios 69
bibliográfica 69
psiquiátricos 69
idéias 69
primários 69
